var _formula = {
//          w     a     d     e     o     s     f     r     x     j
    "a": [ "ă",  "â", "ad", "ae", "ao",  "á",  "à",  "ả",  "ã",  "ạ"],
    "ă": [ "a",  "â", "ad", "ae", "ao",  "ắ",  "ằ",  "ẳ",  "ẵ",  "ặ"],
    "â": [ "ă",  "a", "ad", "ae", "ao",  "ấ",  "ầ",  "ẩ",  "ẫ",  "ậ"],
    "d": ["dw", "da",  "đ", "de", "do", "ds", "df", "dr", "dx", "dj"],
    "e": ["ew", "ea", "ed",  "ê", "eo",  "é",  "è",  "ẻ",  "ẽ",  "ẹ"],
    "ê": ["ew", "ea", "ed",  "e", "eo",  "ế",  "ề",  "ể",  "ễ",  "ệ"],
    "i": ["iw", "ia", "id", "ie", "io",  "í",  "ì",  "ỉ",  "ĩ",  "ị"],
    "o": [ "ơ", "oa", "od", "oe",  "ô",  "ó",  "ò",  "ỏ",  "õ",  "ọ"],
    "ô": [ "ơ", "oa", "od", "oe",  "o",  "ố",  "ồ",  "ổ",  "ỗ",  "ộ"],
    "ơ": [ "o", "oa", "od", "oe",  "ô",  "ớ",  "ờ",  "ở",  "ỡ",  "ợ"],
    "u": [ "ư", "ua", "ud", "ue", "uo",  "ú",  "ù",  "ủ",  "ũ",  "ụ"],
    "ư": [ "u", "ưa", "ud", "ue", "ưo",  "ứ",  "ừ",  "ử",  "ữ",  "ự"]
};
